package com.day30;

import java.util.ArrayList;
import java.util.List;

/**
 * @ClassName Happy
 * @Description TODO渣男
 * @Author 李玉龙
 * @Date 2020/8/30 16:07
 * @Version 1.0
 **/
public class Happy {
    public List<String > wordBook(){
        List<String> list = new ArrayList<String>();
        list.add("我的理想很简单：一屋，二人，三餐，四季。仅此而已。");
        list.add("你眼里的星辰大海，是我从未见过的皓月星空。");
        list.add("我们都是世上多余的人，但至少我们对于彼此都是世界最重要的人。");
        list.add("你知道什么时候空气最好闻嘛 有你在我身边的时候每时每刻都是甜的");
        list.add("关于想你这件事，躲得过对酒当歌的夜，躲不过四下无人的街。");
        list.add("过尽千帆，皆不是吾心所爱；弱水三千，只有你知我冷暖");
        list.add("特别的爱，给特别的你，从清晨到夜晚，从山野到书房，你是那吹动牧场的微风，是洒在窗上的缕缕暖阳，你是一切美好事物的象征。");
        list.add("只有你好像和所有的人完全不同，也许你不会知道，我和你在一起时较之和别人在一起时要活泼得多。与举世绝缘的我，只有你能在我身上引起感应。");
        list.add("吕子乔会哄所有女生，可唯独不会哄美嘉，所以有了后面这句话：“妙语连珠是猎物支支吾吾才是喜欢。”");
        list.add("天使会为了世界背叛你，而我为了你愿意做一个恶魔，为了你而背叛全世界。");
        list.add("我想和你互相浪费，一起虚度短的沉默，长的无意义，一起消磨精致而苍老的宇宙。");
        list.add("忽然想问你一些秋天的事情，比如桂花的花期是多少天，天气冷了要添几件长袖，还有，能不能趁着秋天喜欢我\uD83C\uDF42");
        list.add("幸福是什么，幸福就是牵着一双想牵的手，一起走过繁华喧嚣，一起守候寂寞孤独；就是陪着一个想陪的人，高兴时一起笑，伤悲时一起哭；就是拥有一颗想拥有的心，重复无聊的日子不乏味，做着相同的事情不枯燥，只要我们心中有爱，我们就会幸福，幸福就在当初的承诺中，就在今后的梦想里。");
        list.add("情不知何所起，一往情深。再而衰，三而竭。");
        list.add("我在等一个人， 一个愿意走进我的生命分享我的喜怒哀乐的人，一个知道我曾经无尽的等待因而更加珍惜我的人，一个也许没能参与我的昨天却愿意和我携手走过每一个明天的人， 一个知道我不完美却依然喜欢我的人");
        list.add("“因为你，看见浪卷，看见烟火，看见漂浮的星星，看见云里的炊烟，看见落幕的车站，看见光影斑驳。”");
        list.add("我以为不再每天与你说话，我会很不习惯，事实证明，我猜对了，但是还没过一天就按耐不住了。难道就是他们说的“夫妻不吵隔夜架”？");
        list.add("我最想要拥抱的人是你，想要共度一生的唯一也是你，漫长的人生中，你是我最想放在心里珍视的人。");
        list.add("我们这一生很短，我们终将会失去它，所以不妨大胆一点， 爱一个人，攀一座山，追一次梦，不妨大胆一点，有很多事没有答案。");
        list.add("你在我的人生是可遇而不可求，正因为如此我会加倍把你珍惜，我担心错过你将会遇不到比你更好的女人。");
        list.add("不要愁老之将至，你老了一定很可爱。而且，假如你老了十岁，我当然也同样老了十岁，世界也老了十岁，上帝也老了十岁，一切都是一样。");

        return list;

    }

    public void start(){
        System.out.println("小可耐~~\n我是你的知心大姐姐，把你的不开心和烦恼都告诉我吧~~~\n");
    }

    public void sb(){
        System.out.println("你这个大傻逼！！！");
    }

    public void end(){
        System.out.println("亲爱的：请你等待15分钟，之后，我会告诉你所有的一切*__*");
    }

    public void enter1(){
        System.out.print("知心大姐姐：");
    }

    public void enter2(){
        System.out.print("小可耐：");
    }
}
